## ------------------------------------------------------------
##                  PANDAS WORK_1023_이준기
## ------------------------------------------------------------

In [237]:
import pandas as pd

In [238]:
## ------------------------------------------------------------
# 문제 1. 아래 데이터를 저장 후 조건을 만족하는 코드를 작성하세요.
## ------------------------------------------------------------
data = [
     ["2차전지(생산)", "SK이노베이션", 10.19, 1.29],
     ["해운", "팬오션", 21.23, 0.95],
     ["시스템반도체", "티엘아이", 35.97, 1.12],
     ["해운", "HMM", 21.52, 3.20],
     ["시스템반도체", "아이에이", 37.32, 3.55],
     ["2차전지(생산)", "LG화학", 83.06, 3.75]
 ]
columns = ["테마", "종목명", "PER", "PBR"]

dataDF = pd.DataFrame(data, columns=columns)
display(dataDF)

         테마      종목명    PER   PBR
0  2차전지(생산)  SK이노베이션  10.19  1.29
1        해운      팬오션  21.23  0.95
2    시스템반도체     티엘아이  35.97  1.12
3        해운      HMM  21.52  3.20
4    시스템반도체     아이에이  37.32  3.55
5  2차전지(생산)     LG화학  83.06  3.75

In [239]:
#  (1-1) 종목명, PER, PBR 컬럼만 선택 후 DataFrame으로 저장하는 코드 작성하세요.
dataDF1 = dataDF.loc[:, ['종목명','PER','PBR']]
display(dataDF1)

       종목명    PER   PBR
0  SK이노베이션  10.19  1.29
1      팬오션  21.23  0.95
2     티엘아이  35.97  1.12
3      HMM  21.52  3.20
4     아이에이  37.32  3.55
5     LG화학  83.06  3.75

In [240]:
#  (1-2)  PER이 20미만, 50이상인 데이터만 저장하는 코드 작성하세요.
dataDF2 = dataDF[(dataDF['PER'] < 20) | (dataDF['PER'] >= 50)]
display(dataDF2)

         테마      종목명    PER   PBR
0  2차전지(생산)  SK이노베이션  10.19  1.29
5  2차전지(생산)     LG화학  83.06  3.75

In [241]:
#  (1-3) 종목명을 행인덱스로 설정하는 코드 작성하세요.
dataDF3 = dataDF.set_index(['종목명'])

display(dataDF3)

               테마    PER   PBR
종목명
SK이노베이션  2차전지(생산)  10.19  1.29
팬오션            해운  21.23  0.95
티엘아이       시스템반도체  35.97  1.12
HMM            해운  21.52  3.20
아이에이       시스템반도체  37.32  3.55
LG화학     2차전지(생산)  83.06  3.75

In [242]:
#  (1-4) PBR 컬럼의 데이터를 기준으로 내림차순 정렬해 주세요.
dataDF4 = dataDF.sort_values('PBR')
display(dataDF4)

         테마      종목명    PER   PBR
1        해운      팬오션  21.23  0.95
2    시스템반도체     티엘아이  35.97  1.12
0  2차전지(생산)  SK이노베이션  10.19  1.29
3        해운      HMM  21.52  3.20
4    시스템반도체     아이에이  37.32  3.55
5  2차전지(생산)     LG화학  83.06  3.75

In [243]:
#  (1-5) PER, PBR 순서로 오름차순 정렬해 주세요.
dataDF.sort_values(by = ['PER','PBR'], axis='index', ascending=True)

         테마      종목명    PER   PBR
0  2차전지(생산)  SK이노베이션  10.19  1.29
1        해운      팬오션  21.23  0.95
3        해운      HMM  21.52  3.20
2    시스템반도체     티엘아이  35.97  1.12
4    시스템반도체     아이에이  37.32  3.55
5  2차전지(생산)     LG화학  83.06  3.75

In [244]:
## ------------------------------------------------------------
# 문제 2. 아래 데이터를 저장 후 조건을 만족하는 코드를 작성하세요.
## ------------------------------------------------------------
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28]
 ]
columns = ["종목코드", "종목명", "현재가", "등락률"]

dataDF = pd.DataFrame(data, columns=columns)

display(dataDF)

     종목코드    종목명   현재가   등락률
0  037730     3R  1510  7.36
1  036360  3SOFT  1790  1.65
2  005760   ACTS  1185  1.28

In [245]:
#  (2-1) "종목코드"를 행 인덱스로 설정하세요.
dataDF1 = dataDF.set_index('종목코드')
display(dataDF1)

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

In [246]:
#  (2-2) 아래 결과가 출력되도록 코드 작성하세요.
#        종목명  현재가
# 종목코드
#  037730 3R    1510
#  036360 3SOFT 1790
dataDF2 = dataDF1.drop('등락률', axis=1)
dataDF2 = dataDF2.iloc[:2]
display(dataDF2)

          종목명   현재가
종목코드
037730     3R  1510
036360  3SOFT  1790

In [247]:
#  (2-3) 현재가가 1,500원 이상이면서 1,700원 미만인 값만 출력하세요.
dataDF3 = dataDF[(dataDF['현재가'] >= 1500) & (dataDF['현재가'] < 1700)]
display(dataDF3)

     종목코드 종목명   현재가   등락률
0  037730  3R  1510  7.36

In [248]:
#  (2-4) 목표가는 현재가에서 10% 상승한 가격으로 목표가 컬럼을 추가하세요.
dataDF4 = pd.DataFrame(data, columns=columns)
dataDF4['목표가'] = dataDF['현재가']*1.1
display(dataDF4)

     종목코드    종목명   현재가   등락률     목표가
0  037730     3R  1510  7.36  1661.0
1  036360  3SOFT  1790  1.65  1969.0
2  005760   ACTS  1185  1.28  1303.5

In [249]:
#  (2-5) 아래 LG 데이터를 추가하세요.
#  종목코드 종목명  현재가  등락률
#  066570  LG전자  60000  3.84

data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
    ["066570", "LG전자", 60000, 3.84]
 ]
columns = ["종목코드", "종목명", "현재가", "등락률"]

dataDF5 = pd.DataFrame(data, columns=columns)
display(dataDF5)

     종목코드    종목명    현재가   등락률
0  037730     3R   1510  7.36
1  036360  3SOFT   1790  1.65
2  005760   ACTS   1185  1.28
3  066570   LG전자  60000  3.84

In [250]:
## ------------------------------------------------------------
# 문제 3. 아래 데이터를 저장 후 조건에 맞도록 코드를 작성하세요.
## ------------------------------------------------------------
import numpy as np
data = {"카카오": [np.nan, 221, 35], "NAVER": [52, 47, 3]}
index = [2019, 2020, 2021]

dataDF = pd.DataFrame(data, index=index)
display(dataDF)

        카카오  NAVER
2019    NaN     52
2020  221.0     47
2021   35.0      3

In [251]:
#  (3-1) NAVER 컬럼 삭제해 주세요.
dataDF.drop('NAVER', axis=1)

        카카오
2019    NaN
2020  221.0
2021   35.0

In [252]:
#  (3-2) "삼성전자": [17, 21, 13] 데이터를 추가해 주세요.
dataDF2 = pd.DataFrame(data, index=index)

dataDF2["삼성전자"] = [17, 21, 13]
display(dataDF2)

        카카오  NAVER  삼성전자
2019    NaN     52    17
2020  221.0     47    21
2021   35.0      3    13

In [253]:
#  (3-3) 컬럼명을 기준으로 내림차순 정렬해 주세요.
dataDF3 = dataDF.sort_index(axis=1, ascending=False)
display(dataDF3)

        카카오  NAVER
2019    NaN     52
2020  221.0     47
2021   35.0      3

In [254]:
#  (3-4) 아래 형태가 되도록 코드 작성 하세요
#           2019   2020   2021
#  카카오    NaN    221.0  35.0
#  NAVER    52.0   47.0   3.0
dataDF4 = dataDF.T
display(dataDF4)

       2019   2020  2021
카카오     NaN  221.0  35.0
NAVER  52.0   47.0   3.0

In [255]:
## ------------------------------------------------------------
## 문제 4. 아래 데이터를 저장 후 조건을 만족하는 코드를 작성하세요.
## - 데이터 파일 : 'vgsales.csv'
## ------------------------------------------------------------
FILE_NAME = '../Data/vgsales.csv'

In [256]:
# (4-1) 'Rank' 컬럼을 인덱스로 설정하면서 DataFrame으로 변환하세요.
dataDF = pd.read_csv(FILE_NAME)
dataDF1 = dataDF.set_index('Rank')
dataDF1

,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
Rank,,,,,,,,,,
1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...
16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [257]:
# (4-2) 'Global_Sales' 컬럼을 기준으로 내림차순 정렬하세요.
dataDF.sort_values('Global_Sales', ascending=False)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
...,...,...,...,...,...,...,...,...,...,...,...
16593,16596,Woody Woodpecker in Crazy Castle 5,GBA,2002.0,Platform,Kemco,0.01,0.00,0.00,0.00,0.01
16594,16597,Men in Black II: Alien Escape,GC,2003.0,Shooter,Infogrames,0.01,0.00,0.00,0.00,0.01
16595,16598,SCORE International Baja 1000: The Official Game,PS2,2008.0,Racing,Activision,0.00,0.00,0.00,0.00,0.01
16596,16599,Know How 2,DS,2010.0,Puzzle,7G//AMES,0.00,0.01,0.00,0.00,0.01
16597,16600,Spirits & Spells,GBA,2003.0,Platform,Wanadoo,0.01,0.00,0.00,0.00,0.01

In [258]:
# (4-3) 'Platform'과 'Global_Sales'를 기준으로 정렬하세요.
#       'Platform'은 오름차순으로 정렬하고 'Global_Sales'는 내림차순으로 정렬
dataDF3 = dataDF.sort_values(by = ['Platform', 'Global_Sales'], ascending=[True, False])
dataDF3

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
89,90,Pac-Man,2600,1982.0,Puzzle,Atari,7.28,0.45,0.0,0.08,7.81
239,240,Pitfall!,2600,1981.0,Platform,Activision,4.21,0.24,0.0,0.05,4.50
258,259,Asteroids,2600,1980.0,Shooter,Atari,4.00,0.26,0.0,0.05,4.31
544,545,Missile Command,2600,1980.0,Shooter,Atari,2.56,0.17,0.0,0.03,2.76
607,608,Space Invaders,2600,NaN,Shooter,Atari,2.36,0.14,0.0,0.03,2.53
...,...,...,...,...,...,...,...,...,...,...,...
16530,16533,Sébastien Loeb Rally Evo,XOne,2016.0,Racing,Milestone S.r.l,0.00,0.01,0.0,0.00,0.01
16531,16534,Hitman (2016),XOne,2016.0,Action,Square Enix,0.00,0.01,0.0,0.00,0.01
16562,16565,Mighty No. 9,XOne,2016.0,Platform,Deep Silver,0.01,0.00,0.0,0.00,0.01
16569,16572,Resident Evil 4 HD,XOne,2016.0,Shooter,Capcom,0.01,0.00,0.0,0.00,0.01
16576,16579,Rugby Challenge 3,XOne,2016.0,Sports,Alternative Software,0.00,0.01,0.0,0.00,0.01

In [259]:
# (4-4) 'Year' 컬럼의 타입을 int로 변경하세요.
print(dataDF.Year.dtype)
dataDF['Year'] = dataDF['Year'].fillna(0).astype(int)
print(dataDF.Year.dtype)

float64
int64

In [260]:
#  (4-5) 게임 이름(Name)에 'Super Mario'가 포함된 게임들만 선택하세요.
dataDF[dataDF['Name'].str.contains("Super Mario", case=False, na=False)]

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
1,2,Super Mario Bros.,NES,1985,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
6,7,New Super Mario Bros.,DS,2006,Platform,Nintendo,11.38,9.23,6.50,2.90,30.01
8,9,New Super Mario Bros. Wii,Wii,2009,Platform,Nintendo,14.59,7.06,4.70,2.26,28.62
18,19,Super Mario World,SNES,1990,Platform,Nintendo,12.78,3.75,3.54,0.55,20.61
21,22,Super Mario Land,GB,1989,Platform,Nintendo,10.83,2.71,4.18,0.42,18.14
22,23,Super Mario Bros. 3,NES,1988,Platform,Nintendo,9.54,3.44,3.84,0.46,17.28
46,47,Super Mario 64,N64,1996,Platform,Nintendo,6.91,2.85,1.91,0.23,11.89
48,49,Super Mario Galaxy,Wii,2007,Platform,Nintendo,6.16,3.40,1.20,0.76,11.52
50,51,Super Mario Land 2: 6 Golden Coins,GB,1992,Adventure,Nintendo,6.16,2.04,2.69,0.29,11.18
53,54,Super Mario 3D Land,3DS,2011,Platform,Nintendo,4.89,2.99,2.13,0.78,10.79
57,58,Super Mario All-Stars,SNES,1993,Platform,Nintendo,5.99,2.15,2.12,0.29,10.55
59,60,Super Mario 64,DS,2004,Platform,Nintendo,5.08,3.11,1.25,0.98,10.42
64,65,New Super Mario Bros. 2,3DS,2012,Platform,Nintendo,3.66,3.07,2.47,0.63,9.82
76,77,Super Mario Kart,SNES,1992,Racing,Nintendo,3.54,1.24,3.81,0.18,8.76
91,92,Super Mario Galaxy 2,Wii,2010,Platform,Nintendo,3.66,2.42,0.98,0.64,7.69
96,97,Super Mario Bros. 2,NES,1988,Platform,Nintendo,5.39,1.18,0.70,0.19,7.46
135,136,Super Mario Sunshine,GC,2002,Platform,Nintendo,4.01,1.26,0.87,0.17,6.31
162,163,Super Mario Advance,GBA,2001,Platform,Nintendo,3.14,1.24,0.91,0.20,5.49
164,165,Super Mario World,GBA,2001,Platform,Nintendo,3.21,1.11,0.95,0.20,5.46
182,183,Super Mario Bros. 3,GBA,2003,Platform,Nintendo,2.93,1.25,0.83,0.20,5.20
183,184,New Super Mario Bros. U,WiiU,2012,Platform,Nintendo,2.32,1.30,1.27,0.31,5.19
184,185,Super Mario Land 3: Wario Land,GB,1994,Platform,Nintendo,2.49,0.98,1.57,0.15,5.19
200,201,Super Mario Bros.,GB,1999,Platform,Nintendo,3.40,1.30,0.15,0.22,5.07
261,262,Super Mario 3D World,WiiU,2013,Platform,Nintendo,2.11,1.11,0.72,0.30,4.25
282,283,Super Mario World 2: Yoshi's Island,SNES,1995,Platform,Nintendo,1.65,0.61,1.76,0.09,4.12
429,430,Super Mario Maker,WiiU,2015,Platform,Nintendo,1.18,0.87,0.93,0.20,3.18
492,493,Super Mario World 2: Yoshi's Island,GBA,2002,Platform,Nintendo,1.75,0.45,0.62,0.09,2.91
573,574,Super Mario Bros.: The Lost Levels,NES,1986,Platform,Nintendo,0.00,0.00,2.65,0.00,2.65
587,588,Super Mario All-Stars: Limited Edition,Wii,2010,Platform,Nintendo,1.02,0.52,0.92,0.14,2.60
762,764,Super Mario RPG: Legend of the Seven Stars,SNES,1996,Role-Playing,Nintendo,0.66,0.00,1.45,0.03,2.14
1144,1146,Super Mario Strikers,GC,2005,Sports,Nintendo,0.98,0.38,0.20,0.04,1.61
1351,1353,Classic NES Series: Super Mario Bros.,GBA,2004,Platform,Nintendo,0.00,0.00,1.39,0.03,1.43
4299,4301,Puzzle & Dragons Z + Super Mario Bros. Edition,3DS,2015,Puzzle,Nintendo,0.05,0.05,0.34,0.01,0.46
4588,4590,Famicom Mini: Super Mario Bros. 2,GBA,2004,Platform,Nintendo,0.00,0.00,0.41,0.01,0.42

In [261]:
## ------------------------------------------------------------
# 문제 5. 아래 데이터를 저장 후 조건을 만족하는 코드를 작성하세요.
## ------------------------------------------------------------
# 데이터파일 :  titanic.csv
FILE_NAME = '../Data/titanic.csv'
dataDF = pd.read_csv(FILE_NAME)
dataDF

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [262]:
# (5-1) 단순 조건에 맞는 데이터만 선택 
# ▶ 성별이 여자인 승객 행만 필터링.
# ▶ pclass가 1등석인 승객만.
# ▶ age가 10세 미만인 어린이만.
# ▶ fare가 100이상인 고가 요금 승객만.
dataDF[(dataDF['sex'] == 'female') & (dataDF['pclass'] == 1) & (dataDF['age'] < 10) & (dataDF['fare'] >= 100)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
297,0,1,female,2.0,1,2,151.55,S,First,child,False,C,Southampton,no,False

In [263]:
# (5-2) 아래 조합 조건에 맞는 데이터만 선택
# ▶ 1 또는 2등석인 생존자 데이터만
dataDF[(dataDF['survived'] == 1) & ((dataDF['pclass'] == 1) | (dataDF['pclass'] == 2))]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
874,1,2,female,28.0,1,0,24.0000,C,Second,woman,False,NaN,Cherbourg,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [264]:
# ▶ 가족 동승 3명 이상) 승객 데이터만
dataDF[(dataDF['sibsp'] >= 3)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
24,0,3,female,8.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
50,0,3,male,7.0,4,1,39.6875,S,Third,child,False,NaN,Southampton,no,False
59,0,3,male,11.0,5,2,46.9000,S,Third,child,False,NaN,Southampton,no,False
63,0,3,male,4.0,3,2,27.9000,S,Third,child,False,NaN,Southampton,no,False
68,1,3,female,17.0,4,2,7.9250,S,Third,woman,False,NaN,Southampton,yes,False
71,0,3,female,16.0,5,2,46.9000,S,Third,woman,False,NaN,Southampton,no,False
85,1,3,female,33.0,3,0,15.8500,S,Third,woman,False,NaN,Southampton,yes,False
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
119,0,3,female,2.0,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False
159,0,3,male,NaN,8,2,69.5500,S,Third,man,True,NaN,Southampton,no,False
164,0,3,male,1.0,4,1,39.6875,S,Third,child,False,NaN,Southampton,no,False
171,0,3,male,4.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
176,0,3,male,NaN,3,1,25.4667,S,Third,man,True,NaN,Southampton,no,False
180,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
182,0,3,male,9.0,4,2,31.3875,S,Third,child,False,NaN,Southampton,no,False
201,0,3,male,NaN,8,2,69.5500,S,Third,man,True,NaN,Southampton,no,False
229,0,3,female,NaN,3,1,25.4667,S,Third,woman,False,NaN,Southampton,no,False
233,1,3,female,5.0,4,2,31.3875,S,Third,child,False,NaN,Southampton,yes,False
261,1,3,male,3.0,4,2,31.3875,S,Third,child,False,NaN,Southampton,yes,False
266,0,3,male,16.0,4,1,39.6875,S,Third,man,True,NaN,Southampton,no,False
278,0,3,male,7.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
324,0,3,male,NaN,8,2,69.5500,S,Third,man,True,NaN,Southampton,no,False
341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
374,0,3,female,3.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
386,0,3,male,1.0,5,2,46.9000,S,Third,child,False,NaN,Southampton,no,False
409,0,3,female,NaN,3,1,25.4667,S,Third,woman,False,NaN,Southampton,no,False
480,0,3,male,9.0,5,2,46.9000,S,Third,child,False,NaN,Southampton,no,False
485,0,3,female,NaN,3,1,25.4667,S,Third,woman,False,NaN,Southampton,no,False
541,0,3,female,9.0,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False
542,0,3,female,11.0,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False
634,0,3,female,9.0,3,2,27.9000,S,Third,child,False,NaN,Southampton,no,False
642,0,3,female,2.0,3,2,27.9000,S,Third,child,False,NaN,Southampton,no,False
683,0,3,male,14.0,5,2,46.9000,S,Third,child,False,NaN,Southampton,no,False
686,0,3,male,14.0,4,1,39.6875,S,Third,child,False,NaN,Southampton,no,False
726,1,2,female,30.0,3,0,21.0000,S,Second,woman,False,NaN,Southampton,yes,False
787,0,3,male,8.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
792,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
813,0,3,female,6.0,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False
819,0,3,male,10.0,3,2,27.9000,S,Third,child,False,NaN,Southampton,no,False
824,0,3,male,2.0,4,1,39.6875,S,Third,child,False,NaN,Southampton,no,False
846,0,3,male,NaN,8,2,69.5500,S,Third,man,True,NaN,Southampton,no,False
850,0,3,male,4.0,4,2,31.2750,S,Third,child,False,NaN,Southampton,no,False
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False

In [265]:
# ▶ 혼자 탑승한 성인 남자 데이터만
dataDF[(dataDF['adult_male'] == True) & (dataDF['sibsp'] == 0)]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True